// Вычислить сумму чисел до данного
// важность: 5
// Напишите функцию sumTo(n), которая вычисляет сумму чисел 1 + 2 + ... + n.

// Например:

// sumTo(1) = 1
// sumTo(2) = 2 + 1 = 3
// sumTo(3) = 3 + 2 + 1 = 6
// sumTo(4) = 4 + 3 + 2 + 1 = 10
// ...
// sumTo(100) = 100 + 99 + ... + 2 + 1 = 5050
// Сделайте три варианта решения:

// С использованием цикла.
// Через рекурсию, т.к. sumTo(n) = n + sumTo(n-1) for n > 1.
// С использованием формулы арифметической прогрессии.
// Пример работы вашей функции:

// function sumTo(n) { /*... ваш код ... */ }

// alert( sumTo(100) ); // 5050
// P.S. Какой вариант решения самый быстрый? Самый медленный? Почему?

// P.P.S. Можно ли при помощи рекурсии посчитать sumTo(100000)?





//Итеративный способ: цикл for:

// function sumTo(n) {
//     let result = 1;

//     for (let i = n; i > 1; i--) {
//         result += i;
//     }

//     return result;
// }


//Рекурсия 

function sumTo(n) {
    if (n > 1) {
        return n + sumTo(n - 1);
    } else {
        return n;
    }
}

// С использованием формулы арифметической прогрессии.

// function sumTo(n) {
//     return (1 + n) * n / 2;
// }


//Наиболее быстрая формула арифметической прогрессии тк она использует всего 3 операции (+ , *, /)
//На втором месте цикл, а на последнем рекурсия тк она использует наибольшее количество операций 

console.log(sumTo(1)); // = 1
console.log(sumTo(2)); // = 2 + 1 = 3
console.log(sumTo(3)); // = 3 + 2 + 1 = 6
console.log(sumTo(4)); // = 4 + 3 + 2 + 1 = 10


console.log(sumTo(100000)); // рекурсия переполняет stack и отказывается вычислять такие числа